In [1]:
import numpy as np 
import pandas as pd

In [7]:
# Creating a dataframe 
data = {
    'Name': ['John', 'Anna', 'Peter', 'Linda'],
    'Age': [28, 34, 29, 42],
    'City': ['New York', 'Paris', 'Berlin', 'London'],
    'Salary': [65000, 70000, 62000, 85000]
}
df=pd.DataFrame(data)

In [8]:
df

    Name  Age      City  Salary
0   John   28  New York   65000
1   Anna   34     Paris   70000
2  Peter   29    Berlin   62000
3  Linda   42    London   85000

In [74]:
data_list = [
    ['John', 28, 'New York', 65000],
    ['Anna', 34, 'Paris', 70000],
    ['Peter', 29, 'Berlin', 62000],
    ['Linda', 42, 'London', 85000]
]
df2=pd.DataFrame(data_list)
columns=["Name","Age","City","Salary"]
df2=pd.DataFrame(data_list,columns=columns)

In [22]:
df2

    Name  Age      City  Salary
0   John   28  New York   65000
1   Anna   34     Paris   70000
2  Peter   29    Berlin   62000
3  Linda   42    London   85000

In [ ]:
# Selection and Indexing of Columns

In [23]:
df2

    Name  Age      City  Salary
0   John   28  New York   65000
1   Anna   34     Paris   70000
2  Peter   29    Berlin   62000
3  Linda   42    London   85000

In [25]:
df2['Name']

0     John
1     Anna
2    Peter
3    Linda
Name: Name, dtype: object

In [28]:
df2[['Name','City']]

    Name      City
0   John  New York
1   Anna     Paris
2  Peter    Berlin
3  Linda    London

In [ ]:
# Creating a new Column

In [47]:
df2["Designation"]=["Doctor","IAS","IPS","ENGG."]

In [48]:
df2

    Name  Age      City  Salary Designation
0   John   28  New York   65000      Doctor
1   Anna   34     Paris   70000         IAS
2  Peter   29    Berlin   62000         IPS
3  Linda   42    London   85000       ENGG.

In [49]:
# Removing Columns

In [50]:
df2.drop('Designation',axis=1,inplace=True)

In [51]:
df2

    Name  Age      City  Salary
0   John   28  New York   65000
1   Anna   34     Paris   70000
2  Peter   29    Berlin   62000
3  Linda   42    London   85000

In [52]:
df2.drop(['City','Salary'],axis=1,inplace=True)

In [53]:
df2}

    Name  Age
0   John   28
1   Anna   34
2  Peter   29
3  Linda   42

In [54]:
df2.drop(0,axis=0)

    Name  Age
1   Anna   34
2  Peter   29
3  Linda   42

In [55]:
df2

    Name  Age
0   John   28
1   Anna   34
2  Peter   29
3  Linda   42

In [57]:
# Selecting Rows

In [62]:
df2.loc[[0,1]]

   Name  Age
0  John   28
1  Anna   34

In [63]:
df2.iloc[[0,1]]

   Name  Age
0  John   28
1  Anna   34

In [69]:
# Selecting Subsets of rows and columns

In [70]:
df2["Designation"]=["Doctor","IAS","IPS","ENGG."]

In [71]:
df2

    Name  Age Designation
0   John   28      Doctor
1   Anna   34         IAS
2  Peter   29         IPS
3  Linda   42       ENGG.

In [72]:
df2.loc[[0,1]][['Name','Designation']]

   Name Designation
0  John      Doctor
1  Anna         IAS

In [73]:
# Conditional Selection

In [81]:
df2

    Name  Age      City  Salary
0   John   28  New York   65000
1   Anna   34     Paris   70000
2  Peter   29    Berlin   62000
3  Linda   42    London   85000

In [82]:
# I only want to see those people whose age is above 30

In [83]:
df2[df2["Age"]>30]

    Name  Age    City  Salary
1   Anna   34   Paris   70000
3  Linda   42  London   85000

In [84]:
# I only want to see those people whose age is above 30 and their city must be paris

In [86]:
df2[(df2["Age"]>30) & (df2["City"]=='Paris')]

   Name  Age   City  Salary
1  Anna   34  Paris   70000